---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutOfPlaneBendDiameterTooSmall
source: html/2b1038ec-47ad-ecf3-cd76-ee874c8159e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.OutOfPlaneBendDiameterTooSmall Property

The Out of Plane Bend Diameter for Rebar Shape XX is too small for Rebar Bar Type YY.

## Syntax (C#)
```csharp
public static FailureDefinitionId OutOfPlaneBendDiameterTooSmall { get; }
```